# --- SUCCESS MESSAGES ---
success.weather.get=L\u1EA5y d\u1EEF li\u1EC7u th\u1EDDi ti\u1EBFt th\u00E0nh c\u00F4ng
success.auth.logout=\u0110\u0103ng xu\u1EA5t th\u00E0nh c\u00F4ng!
success.auth.forgot_password=N\u1EBFu email t\u1ED3n t\u1EA1i, ch\u00FAng t\u00F4i \u0111\u00E3 g\u1EEDi li\u00EAn k\u1EBFt kh\u00F4i ph\u1EE5c.
success.auth.reset_password=M\u1EADt kh\u1EA9u \u0111\u00E3 \u0111\u01B0\u1EE3c \u0111\u1EB7t l\u1EA1i th\u00E0nh c\u00F4ng.
success.auth.resend_verification=N\u1EBFu email t\u1ED3n t\u1EA1i v\u00E0 ch\u01B0a x\u00E1c th\u1EF1c, ch\u00FAng t\u00F4i \u0111\u00E3 g\u1EEDi li\u00EAn k\u1EBFt x\u00E1c th\u1EF1c m\u1EDBi.
success.user.password_changed=\u0110\u1ED5i m\u1EADt kh\u1EA9u th\u00E0nh c\u00F4ng
success.user.deleted=X\u00F3a ng\u01B0\u1EDDi d\u00F9ng th\u00E0nh c\u00F4ng
success.user.restored=Kh\u00F4i ph\u1EE5c ng\u01B0\u1EDDi d\u00F9ng th\u00E0nh c\u00F4ng
success.user.status_toggled=Chuy\u1EC3n tr\u1EA1ng th\u00E1i ng\u01B0\u1EDDi d\u00F9ng th\u00E0nh c\u00F4ng

# --- ERROR MESSAGES ---
error.validation=D\u1EEF li\u1EC7u \u0111\u1EA7u v\u00E0o kh\u00F4ng h\u1EE3p l\u1EC7
error.param.missing=Thi\u1EBFu tham s\u1ED1 b\u1EAFt bu\u1ED9c
error.internal=L\u1ED7i h\u1EC7 th\u1ED1ng n\u1ED9i b\u1ED9
error.weather.api=L\u1ED7i khi g\u1ECDi API th\u1EDDi ti\u1EBFt
error.param.type=Ki\u1EC3u d\u1EEF li\u1EC7u tham s\u1ED1 kh\u00F4ng \u0111\u00FAng
error.unauthorized=B\u1EA1n c\u1EA7n \u0111\u0103ng nh\u1EADp \u0111\u1EC3 th\u1EF1c hi\u1EC7n ch\u1EE9c n\u0103ng n\u00E0y
error.forbidden=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp v\u00E0o t\u00E0i nguy\u00EAn n\u00E0y

error.login.bad_credentials=T\u00EAn \u0111\u0103ng nh\u1EADp ho\u1EB7c m\u1EADt kh\u1EA9u kh\u00F4ng ch\u00EDnh x\u00E1c
error.account.locked=T\u00E0i kho\u1EA3n \u0111\u00E3 b\u1ECB kh\u00F3a
error.account.disabled=T\u00E0i kho\u1EA3n ch\u01B0a \u0111\u01B0\u1EE3c k\u00EDch ho\u1EA1t
error.account.deleted=T\u00E0i kho\u1EA3n \u0111\u00E3 b\u1ECB x\u00F3a ho\u1EB7c kh\u00F4ng t\u1ED3n t\u1EA1i
error.account.verified=T\u00E0i kho\u1EA3n \u0111\u00E3 \u0111\u01B0\u1EE3c x\u00E1c th\u1EF1c
error.account.unverify=Vui l\u00F2ng ki\u1EC3m tra email c\u1EE7a b\u1EA1n \u0111\u1EC3 k\u00EDch ho\u1EA1t t\u00E0i kho\u1EA3n.
error.token.invalid=Token kh\u00F4ng h\u1EE3p l\u1EC7
error.token.expired=Phi\u00EAn \u0111\u0103ng nh\u1EADp \u0111\u00E3 h\u1EBFt h\u1EA1n, vui l\u00F2ng \u0111\u0103ng nh\u1EADp l\u1EA1i
error.token.revoked=Token \u0111\u00E3 b\u1ECB v\u00F4 hi\u1EC7u h\u00F3a (\u0111\u00E3 logout)

error.user.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y ng\u01B0\u1EDDi d\u00F9ng
error.user.password.incorrect=M\u1EADt kh\u1EA9u c\u0169 kh\u00F4ng ch\u00EDnh x\u00E1c
error.user.password.notmatch=M\u1EADt kh\u1EA9u m\u1EDBi v\u00E0 x\u00E1c nh\u1EADn m\u1EADt kh\u1EA9u kh\u00F4ng kh\u1EDBp
error.user.existed=Ng\u01B0\u1EDDi d\u00F9ng \u0111\u00E3 t\u1ED3n t\u1EA1i
error.user.email.existed=Email \u0111\u00E3 \u0111\u01B0\u1EE3c \u0111\u0103ng k\u00FD
error.user.role.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y vai tr\u00F2
error.user.notdelete=Ng\u01B0\u1EDDi d\u00F9ng ch\u01B0a \u0111\u01B0\u1EE3c x\u00F3a
error.endpoint.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y endpoint API
error.email.send_failed=Kh\u00F4ng th\u1EC3 g\u1EEDi email, vui l\u00F2ng th\u1EED l\u1EA1i sau.
error.json.unreadable=D\u1EEF li\u1EC7u g\u1EEDi l\u00EAn kh\u00F4ng h\u1EE3p l\u1EC7 ho\u1EB7c sai \u0111\u1ECBnh d\u1EA1ng

# Chat / conversation errors
error.chat.conversation.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y cu\u1ED9c tr\u00F2 chuy\u1EC7n
error.chat.conversation.already_exists=Cu\u1ED9c tr\u00F2 chuy\u1EC7n \u0111\u00E3 t\u1ED3n t\u1EA1i
error.chat.conversation.member_limit=S\u1ED1 l\u01B0\u1EE3ng th\u00E0nh vi\u00EAn \u0111\u00E3 v\u01B0\u1EE3t qu\u00E1 gi\u1EDBi h\u1EA1n
error.chat.conversation.invalid_member_count=S\u1ED1 l\u01B0\u1EE3ng th\u00E0nh vi\u00EAn kh\u00F4ng h\u1EE3p l\u1EC7
error.chat.conversation.not_group=Cu\u1ED9c tr\u00F2 chuy\u1EC7n n\u00E0y kh\u00F4ng ph\u1EA3i nh\u00F3m
error.chat.conversation.access_denied=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp cu\u1ED9c tr\u00F2 chuy\u1EC7n n\u00E0y
error.chat.conversation.admin_required=B\u1EA1n c\u1EA7n quy\u1EC1n qu\u1EA3n tr\u1ECB vi\u00EAn \u0111\u1EC3 th\u1EF1c hi\u1EC7n h\u00E0nh \u0111\u1ED9ng n\u00E0y
error.chat.participant.already_exists=Th\u00E0nh vi\u00EAn \u0111\u00E3 t\u1ED3n t\u1EA1i trong cu\u1ED9c tr\u00F2 chuy\u1EC7n
error.chat.participant.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y th\u00E0nh vi\u00EAn trong cu\u1ED9c tr\u00F2 chuy\u1EC7n
error.chat.conversation.only_admin_can_delete_member=Ch\u1EC9 qu\u1EA3n tr\u1ECB vi\u00EAn m\u1EDBi c\u00F3 th\u1EC3 x\u00F3a th\u00E0nh vi\u00EAn
error.chat.conversation.must_transfer_admin_before_leaving=B\u1EA1n ph\u1EA3i chuy\u1EC3n quy\u1EC1n qu\u1EA3n tr\u1ECB tr\u01B0\u1EDBc khi r\u1EDDi nh\u00F3m
error.chat.conversation.participant_invalid=Th\u00E0nh vi\u00EAn \u0111\u01B0\u1EE3c ch\u1ECDn kh\u00F4ng h\u1EE3p l\u1EC7 cho thao t\u00E1c n\u00E0y
error.chat.conversation.only_admin_can_dissolve_group=Ch\u1EC9 qu\u1EA3n tr\u1ECB vi\u00EAn m\u1EDBi c\u00F3 th\u1EC3 gi\u1EA3i t\u00E1n nh\u00F3m
error.chat.conversation.nickname_not_blank=Bi\u1EC7t danh kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng
error.chat.conversation.only_admin_can_edit_info=Ch\u1EC9 qu\u1EA3n tr\u1ECB vi\u00EAn m\u1EDBi c\u00F3 th\u1EC3 ch\u1EC9nh s\u1EEDa th\u00F4ng tin nh\u00F3m
error.chat.message.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y tin nh\u1EAFn
error.chat.message.edit_denied=B\u1EA1n kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p ch\u1EC9nh s\u1EEDa tin nh\u1EAFn n\u00E0y
error.chat.message.recall_denied=B\u1EA1n kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p thu h\u1ED3i tin nh\u1EAFn n\u00E0y
error.chat.dm.self=B\u1EA1n kh\u00F4ng th\u1EC3 t\u1EA1o cu\u1ED9c tr\u00F2 chuy\u1EC7n ri\u00EAng v\u1EDBi ch\u00EDnh m\u00ECnh

# --- VALIDATION MESSAGES ---
weather.latitude.notNull=V\u0129 \u0111\u1ED9 kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng
weather.latitude.min=V\u0129 \u0111\u1ED9 ph\u1EA3i l\u1EDBn h\u01A1n ho\u1EB7c b\u1EB1ng -90
weather.latitude.max=V\u0129 \u0111\u1ED9 ph\u1EA3i nh\u1ECF h\u01A1n ho\u1EB7c b\u1EB1ng 90
weather.longitude.notNull=Kinh \u0111\u1ED9 kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng
weather.longitude.min=Kinh \u0111\u1ED9 ph\u1EA3i l\u1EDBn h\u01A1n ho\u1EB7c b\u1EB1ng -180
weather.longitude.max=Kinh \u0111\u1ED9 ph\u1EA3i nh\u1ECF h\u01A1n ho\u1EB7c b\u1EB1ng 180
